tap "adoptopenjdk/openjdk"
tap "caskroom/versions"
tap "coursier/formulas"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "lampepfl/brew"
tap "olafurpg/scalafmt"
tap "scalacenter/bloop"
brew "autojump"
brew "aws-iam-authenticator"
brew "python"
brew "awscli"
brew "bat"
brew "cowsay"
brew "ctags"
brew "direnv"
brew "docker-machine-driver-hyperkit"
brew "exa"
brew "exercism"
brew "fd"
brew "fortune"
brew "fzf"
brew "fzy"
brew "git"
brew "git-lfs"
brew "haskell-stack"
brew "hyperkit", link: false
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "lolcat"
brew "neofetch"
brew "neovim"
brew "node"
brew "pipenv"
brew "procs"
brew "ripgrep"
brew "rustup-init"
brew "sbt"
brew "sd"
brew "terraform@0.11", link: true
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "watch"
brew "wget"
brew "xsv"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier"
brew "derailed/k9s/k9s"
brew "lampepfl/brew/dotty"
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
brew "scalacenter/bloop/bloop"
cask "alacritty"
cask "caffeine"
cask "cyberduck"
cask "docker"
cask "flux"
cask "font-hasklig-nerd-font"
cask "fork"
cask "graphiql"
cask "hammerspoon"
cask "ipynb-quicklook"
cask "java"
cask "java8"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "netnewswire"
cask "quicklook-csv"
cask "quicklook-json"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "tunnelblick"
cask "visual-studio-code"
