tap "coursier/formulas"
tap "dbt-labs/dbt"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jimdo/wonderland", "git@github.com:Jimdo/homebrew-wonderland.git"
tap "lampepfl/brew"
tap "olafurpg/scalafmt"
tap "saulpw/vd"
tap "scalacenter/bloop"
tap "uptech/oss"
tap "weaveworks/tap"
# Development kit for the Java programming language
brew "openjdk"
# Engine for large-scale data processing
brew "apache-spark"
# Shell extension to jump to frequently used directories
brew "autojump"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Machine driver for hyperkit
brew "docker-machine-driver-hyperkit"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# File format designed to store large amounts of data
brew "hdf5"
# Command-line hex viewer
brew "hexyl"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Linear Algebra PACKage
brew "lapack"
# Postgres C API library
brew "libpq"
# Library for USB device access
brew "libusb"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Rainbows and unicorns in your console!
brew "lolcat"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@5.7"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup-init"
# Build tool for Scala projects
brew "sbt"
# Intuitive find & replace CLI
brew "sd"
# SMART hard drive monitoring
brew "smartmontools"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Framework for scalable cross-language services development
brew "thrift"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Tool for running tasks in containers
brew "toast"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Redshift adapter plugin for dbt
brew "dbt-labs/dbt/dbt-redshift"
# dbt-redshift contains all of the code enabling dbt to work with Redshift
brew "dbt-labs/dbt/dbt-redshift@1.0.0", link: false
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# The Wonderland 2 command-line tool
brew "jimdo/wonderland/wl2"
# Experimental Scala Compiler
brew "lampepfl/brew/dotty"
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Installs the Bloop CLI for Bloop, a build server to compile, test and run Scala fast
brew "scalacenter/bloop/bloop"
# Command-line utility to find alternate file
brew "uptech/oss/alt"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# GPU-accelerated terminal emulator
cask "alacritty"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox-developer-edition"
# Screen color temperature controller
cask "flux"
cask "font-devicons"
cask "font-hasklig-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome-dev"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake"
cask "ipynb-quicklook"
# Decentralised instant messenger and softphone
cask "jami"
cask "java"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Programming language for technical computing
cask "julia"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# Kubernetes IDE
cask "lens"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Self-contained Python driver for communicating with MySQL servers
cask "mysql-connector-python"
# Free and open-source RSS reader
cask "netnewswire"
# Tool to scan and monitor the network
cask "network-radar"
# App to write, plan, collaborate, and get organized
cask "notion"
cask "quicklook-csv"
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
# Flash tool for ZSA keyboards
cask "zsa-wally"
