tap "coursier/formulas"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "lampepfl/brew"
tap "olafurpg/scalafmt"
tap "saulpw/vd"
tap "scalacenter/bloop"
tap "uptech/oss"
tap "weaveworks/tap"
cask "adoptopenjdk"
# Shell extension to jump to frequently used directories
brew "autojump"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Load/unload environment variables based on $PWD
brew "direnv"
# Docker Machine driver for hyperkit
brew "docker-machine-driver-hyperkit"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# File format designed to store large amounts of data
brew "hdf5"
# Command-line hex viewer
brew "hexyl"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit", link: false
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Postgres C API library
brew "libpq"
# Library for USB device access
brew "libusb"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Rainbows and unicorns in your console!
brew "lolcat"
# Package manager for the Lua programming language
brew "luarocks"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup-init"
# Build tool for Scala projects
brew "sbt"
# Intuitive find & replace CLI
brew "sd"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform@0.11", link: true
# Programatically correct mistyped console commands
brew "thefuck"
# Framework for scalable cross-language services development
brew "thrift"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Coursier launcher.
brew "coursier/formulas/coursier"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Experimental Scala Compiler
brew "lampepfl/brew/dotty"
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Installs the Bloop CLI for Bloop, a build server to compile, test and run Scala fast
brew "scalacenter/bloop/bloop"
# command-line utility to find alternate file
brew "uptech/oss/alt"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "adoptopenjdk11"
cask "adoptopenjdk12"
cask "adoptopenjdk8"
cask "alacritty"
cask "caffeine"
cask "cyberduck"
cask "discord"
cask "docker"
cask "flux"
cask "font-hasklig-nerd-font"
cask "font-juliamono"
cask "fork"
cask "google-chrome-dev"
cask "graphiql"
cask "hammerspoon"
cask "handbrake"
cask "ipynb-quicklook"
cask "java"
cask "jetbrains-toolbox"
cask "julia"
cask "karabiner-elements"
cask "netnewswire"
cask "notion"
cask "quicklook-csv"
cask "quicklook-json"
cask "slack"
cask "spotify"
cask "steam"
cask "tableplus"
cask "the-unarchiver"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "zsa-wally"
